<c><h3><b>Sales Order DB Architecture with ACID-Compliant Business Logic</b></h3></c>

In [ ]:
# !pip install ipython-sql pymysql  mysql-connector-python mysqlclient mysql

In [ ]:
%load_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:password@localhost:3306/

# Create Database

In [ ]:
%%sql
DROP DATABASE IF EXISTS customersDB;
CREATE DATABASE customersDB;

In [ ]:
%%sql
USE customersDB;
show tables;

# Create Tables

In [ ]:
%%sql
# customers table dimension table
DROP TABLE IF EXISTS customers;
CREATE TABLE customers(customer_id INT AUTO_INCREMENT,                          #auto
                        first_name VARCHAR(100) NOT NULL,                                   #manual
                        last_name VARCHAR(100) NOT NULL,                                    #manual
                        gender ENUM('male','female','other','prefer not to say') NOT NULL DEFAULT 'prefer not to say',  #manual (trigger for prefer not to say)
                        age INT,                                                            #manual
                        email VARCHAR(100) NOT NULL,                                 #manual
                        ph_num VARCHAR(20) NOT NULL,                                        #manual
                        address VARCHAR(100) NOT NULL,                                     #manual
                        city VARCHAR(50) NOT NULL,                                          #manual
                        state VARCHAR(50) NOT NULL,                                        #manual
                        postal_code VARCHAR(10) NOT NULL,                                   #manual
                        country VARCHAR(100) NOT NULL,                                       #manual
                        registration_date DATETIME(4),                #auto
                        PRIMARY KEY(customer_id, registration_date)
                        )
PARTITION BY RANGE (YEAR(registration_date))
    (
        PARTITION p_before_2020 VALUES LESS THAN (2021),
        PARTITION p2021 VALUES LESS THAN (2022),
        PARTITION p2022 VALUES LESS THAN (2023),
        PARTITION p2023 VALUES LESS THAN (2024),
        PARTITION p2024 VALUES LESS THAN (2025),
        PARTITION p2025 VALUES LESS THAN (2026),
        PARTITION p_future VALUES LESS THAN MAXVALUE
    );

CREATE INDEX age_index ON customers(age);
CREATE INDEX gender_index ON customers(gender);
CREATE INDEX location_index ON customers(city,state,country);

In [ ]:
%%sql
# category dim table 
DROP TABLE IF EXISTS category;
CREATE TABLE category(
    category_id INT PRIMARY KEY AUTO_INCREMENT,         #auto
    category_name VARCHAR(50) NOT NULL UNIQUE,          #manual
    description VARCHAR(100) NOT NULL UNIQUE,           #manual
    updated_on DATETIME DEFAULT CURRENT_TIMESTAMP       #auto/(trigger)
    );

In [ ]:
%%sql
# products table fact table(contains category table)
DROP TABLE IF EXISTS products;
CREATE TABLE products(
    product_id INT PRIMARY KEY AUTO_INCREMENT,  # automatic
    product_name VARCHAR(50) NOT NULL UNIQUE,          # manual 
    description VARCHAR(100) NOT NULL UNIQUE,          # manual
    category_id INT NOT NULL,                   # manual
    FOREIGN KEY (category_id) REFERENCES category(category_id)
    );

In [ ]:
%%sql
# inventory fact(1) dimension table
DROP TABLE IF EXISTS inventory;
CREATE TABLE inventory(
    inventory_id INT PRIMARY KEY AUTO_INCREMENT,        #auto
    product_id INT NOT NULL,                            #manual
    quantity INT NOT NULL CHECK (quantity >=0),         #manual
    last_updated DATETIME DEFAULT CURRENT_TIMESTAMP,    #auto/trigger
    FOREIGN KEY (product_id) REFERENCES products(product_id)
    );

In [ ]:
%%sql
# price table fact(1) table
DROP TABLE IF EXISTS price_history;
CREATE TABLE price_history(
    price_history_id INT PRIMARY KEY AUTO_INCREMENT,                    # automatic
    product_id INT NOT NULL UNIQUE,                             # manual
    price DECIMAL(10,2) NOT NULL CHECK(price>0),                # manual
    effective_date DATE NOT NULL,
    fiscal_year YEAR,
    last_updated DATETIME DEFAULT CURRENT_TIMESTAMP,            # auto/trigger
    FOREIGN KEY (product_id) REFERENCES products(product_id)
    );

CREATE INDEX id_date_index ON price_history(product_id, effective_date);

In [ ]:
%%sql
# orderitems table fact(3) table
DROP TABLE IF EXISTS orderitems;
CREATE TABLE orderitems(
    orderitem_id INT PRIMARY KEY AUTO_INCREMENT,                    #auto
    order_id INT NOT NULL,                                          #manual/create here
    product_id INT NOT NULL,                                        #manual
    customer_id INT NOT NULL,                                       #manual
    seller_id INT NOT NULL,                                         #manual
    quantity INT NOT NULL,                                          #manual
    total_amount INT NOT NULL,                                      #trigger data from price table/procedure
    FOREIGN KEY(product_id) REFERENCES products(product_id)
    );

In [ ]:
%%sql
# employees table dim
DROP TABLE IF EXISTS employees;
CREATE TABLE employees(
    employee_id INT PRIMARY KEY AUTO_INCREMENT,                     #auto
    first_name VARCHAR(50) NOT NULL,                                #manual
    last_name VARCHAR(50) NOT NULL,                                 #manual
    age INT NOT NULL CHECK(age<=60),                                #manual
    phone_number VARCHAR(16) NOT NULL,                              #manual
    email VARCHAR(50) NOT NULL UNIQUE,                              #manual
    hire_date DATE DEFAULT (CURRENT_DATE),                          #manual
    role VARCHAR(20) NOT NULL,                                      #manual
    termination_date DATE DEFAULT NULL,                             #manual/default null
    manager_id INT,                                                 #manual
    is_working BOOLEAN NOT NULL DEFAULT TRUE,                       #manual/fefault null
    FOREIGN KEY (manager_id) REFERENCES employees(employee_id)
    );

In [ ]:
%%sql
# orders table fact(1) table
DROP TABLE IF EXISTS orders;
CREATE TABLE orders(
    order_id INT PRIMARY KEY AUTO_INCREMENT,   #CREATE FROM ORDERITEMS BY procedure unique
    customer_id INT NOT NULL,   #CREATE FROM ORDERITEMS BY procedure unique
    total_quantity INT NOT NULL,     #sum trigger from orderitems
    total_amount INT NOT NULL,  #sum trigger from orderitems
    order_date DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP # auto
);

In [ ]:
%%sql
# shipping table fact(1) table
DROP TABLE IF EXISTS shipping;
CREATE TABLE shipping(
    shipping_id INT PRIMARY KEY AUTO_INCREMENT,   #auto
    order_id INT NOT NULL,                              #procedure
    shipping_date DATE NULL,                            #manual
    shipping_status ENUM('shipped', 'pending', 'delivered','cancelled') DEFAULT 'pending',#manual
    delivery_date DATE,                                     #MANUAL
    shipping_addresss VARCHAR(200) NOT NULL,                #manual or can be populate from customers table if same address
    city VARCHAR(50) NOT NULL,                              #manual
    state VARCHAR(50) NOT NULL,                             #manual
    postalcode VARCHAR(10) NOT NULL,                        #manual
    country VARCHAR(100) NOT NULL,
    FOREIGN KEY (order_id) REFERENCES orders(order_id)
    );

In [ ]:
%%sql
# log table (audit table)
DROP TABLE IF EXISTS audit;
CREATE TABLE audit(
    log_id INT PRIMARY KEY AUTO_INCREMENT,
    action VARCHAR(10) NOT NULL,
    changed_by VARCHAR(50) NOT NULL,
    on_table VARCHAR(20) NOT NULL,
    on_column VARCHAR(200) NOT NULL,
    old_value VARCHAR(200),
    new_value VARCHAR(500),
    time DATETIME NOT NULL DEFAULT CURRENT_TIMESTAMP
    );

In [ ]:
    %%sql
    DROP TABLE IF EXISTS cart;
    CREATE TABLE cart(
        product_id INT NOT NULL,
        customer_id INT NOT NULL,
        seller_id INT NOT NULL,
        quantity INT NOT NULL,
        total_amount INT NOT NULL,
        done BOOLEAN NOT NULL DEFAULT 0,
        FOREIGN KEY(seller_id) REFERENCES employees(employee_id),
        FOREIGN KEY(product_id) REFERENCES products(product_id)
    );

In [ ]:
%%sql
USE customersdb;
SHOW TABLES;

# Triggers

In [ ]:
%%sql
DROP TRIGGER IF EXISTS update_after_customer_table;
CREATE TRIGGER update_after_customer_table
AFTER UPDATE ON customers
FOR EACH ROW
BEGIN
    INSERT INTO audit(action,changed_by,on_table,on_column,old_value,new_value)
    VALUES ('update',USER(),'customers','all',null,'all');
END;

In [ ]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_category_table;
CREATE TRIGGER update_date_on_category_table
AFTER UPDATE ON category
FOR EACH ROW
BEGIN

    DECLARE name BOOLEAN DEFAULT FALSE;
    DECLARE des BOOLEAN DEFAULT FALSE;
    DECLARE oval VARCHAR(150);
    DECLARE nval VARCHAR(150);
    DECLARE col VARCHAR(50);

    UPDATE category
    SET updated_on = NOW()
    WHERE category_id = OLD.category_id;

    IF OLD.category_name <> NEW.category_name THEN
        SET name = TRUE;
    END IF;

    IF OLD.description = MEW.description THEN
        SET des = TRUE;
    END IF;

    IF name AND des THEN 
        SET oval = CONCAT(OLD.category_name,OLD.description);
        SET nval= CONCAT(NEW.category_name,NEW.description);
        SET col = 'name and description';
    ELSEIF name THEN
        SET oval = OLD.category_name;
        SET nval = NEW.category_name;
        SET col = 'name';
    ELSEIF des THEN
        SET oval = OLD.description;
        SET nval = NEW.description;
        SET col = 'description';
    END IF;

    INSERT INTO audit(action,changed_by,on_table,on_column,old_value,new_value)
    VALUES ('update',USER(),'category',col,oval,nval);
END

In [ ]:
%%sql
DROP TRIGGER IF EXISTS price_update_on_price_table;
CREATE TRIGGER price_update_on_price_table
AFTER UPDATE ON price_history
FOR EACH ROW
BEGIN

    DECLARE pri BOOLEAN DEFAULT FALSE;

    UPDATE price
    SET last_updated = NOW()
    WHERE product_id = OLD.product_id;


    INSERT INTO audit(action,changed_by,on_table,on_column,old_value,new_value)
    VALUES ('update',USER(),'price','price',OLD.price,NEW.price);
END;


DROP TRIGGER IF EXISTS price_delete_on_price_table;
CREATE TRIGGER price_delete_on_price_table
AFTER DELETE ON price_history
FOR EACH ROW
BEGIN

    DECLARE pri INT DEFAULT 0;

    INSERT INTO audit(action,changed_by,on_table,on_column,old_value,new_value)
    VALUES ('update',USER(),'price','price',OLD.price,NULL);
END;

# update triggers

In [ ]:
%%sql
DROP TRIGGER IF EXISTS update_date_on_inventory_table;
CREATE TRIGGER update_date_on_inventory_table
AFTER UPDATE ON inventory
FOR EACH ROW
BEGIN
    UPDATE inventory
    SET last_updated = NOW()
    WHERE product_id = OLD.product_id;
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS update_manager_employees;
CREATE PROCEDURE update_manager_employees(
    IN e_id INT,
    IN m_id INT)
BEGIN
    UPDATE employees
    SET manager_id = m_id
    WHERE employee_id = e_id;
END

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS update_termination_employees;
CREATE PROCEDURE update_termination_employees(
    IN e_id INT
)
BEGIN
    UPDATE employees
    SET termination_date = CURRDATE(), is_working = 0
    WHERE employee_id = e_id;
END

# Insert procedure

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS insert_date_in_customers;
CREATE PROCEDURE insert_date_in_customers(
    IN p_fname VARCHAR(100), 
    IN p_lname VARCHAR(100),
    IN p_gen VARCHAR(10),
    IN p_age INT,
    IN p_email VARCHAR(100),
    IN p_phone VARCHAR(20),
    IN p_addr VARCHAR(100),
    IN p_city VARCHAR(50),
    IN p_state VARCHAR(50),
    IN p_post VARCHAR(10),
    IN p_country VARCHAR(50)
    )
BEGIN
    DECLARE p_mail BOOLEAN DEFAULT FALSE;
    DECLARE p_ph BOOLEAN DEFAULT FALSE;

    IF EXISTS (SELECT 1 FROM customers WHERE email = p_email) THEN
        SET p_mail = TRUE;
    END IF; 

    IF EXISTS (SELECT 1 FROM customers WHERE ph_num = p_phone) THEN
            SET p_ph = TRUE;
    END IF; 

    IF p_mail AND p_ph THEN 
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This Email and Phone number already Registered. Please Use Different Email and Phone number.';
    ELSEIF p_mail THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This Email-ID already Registered. Please Use Different Email-ID.';
    ELSEIF p_ph THEN
        SIGNAL SQLSTATE '45000'
        SET MESSAGE_TEXT = 'This phone number already Registered. Please Use Different Phone number.';
    END IF;

    IF p_age <=0 THEN
        SET p_age = NULL;
    END IF;

    IF p_gen IS NULL THEN
        SET p_gen = 'prefer not to say';
    END IF;

    INSERT INTO customers (first_name,last_name,gender,age,email,ph_num,
    address,city,state,postal_code,country,registration_date)
    VALUES
    (p_fname,p_lname,p_gen,p_age,p_email,p_phone,p_addr,p_city,p_state,p_post,p_country,NOW(4));


    INSERT INTO audit (action, changed_by, on_table, on_column, old_value, new_value)
    VALUES ('insert', USER(), 'customers', 'all', NULL,
        CONCAT('Inserted:',p_fname, ' ',p_lname,', Email:',p_email,',Phone:',p_phone));

END

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_category;
CREATE PROCEDURE insert_values_category(IN name VARCHAR(50),
                                        IN des VARCHAR(100))
BEGIN
    INSERT INTO category(category_name, description)
    VALUES (name,des);
END

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_products;
CREATE PROCEDURE insert_values_products(
    IN name VARCHAR(50),
    IN des VARCHAR(100),
    IN cat INT
)
BEGIN 
    INSERT INTO products(product_name,description,category_id)
    VALUES (name,des,cat);

    INSERT INTO audit(action, changed_by, on_table, on_column, old_value, new_value)
    VALUES ('insert', USER(), 'products', 'all', NULL, CONCAT('Product: ', name));
END

In [ ]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_inventory;
CREATE PROCEDURE insert_values_inventory(
    IN pid INT,
    IN qty INT)
BEGIN
    INSERT INTO inventory(product_id,quantity)
    VALUES (pid,qty);

    INSERT INTO audit(action, changed_by, on_table, on_column, old_value, new_value)
    VALUES ('insert', USER(), 'products', 'all', NULL, CONCAT('Product: ', pid, 'Quantity: ',qty));
END

In [182]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_price;
CREATE PROCEDURE insert_values_price(
    IN pid INT,
    IN price INT,
    IN start_at DATE)
BEGIN
    DECLARE yr YEAR DEFAULT YEAR(CURDATE());

    INSERT INTO price_history(product_id,price,fiscal_year,effective_date)
    VALUES (pid,price,yr,start_at);

    INSERT INTO audit(action,changed_by,on_table,on_column,old_value,new_value)
    VALUES ('insert',USER(),'price','price',NULL,price);

END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [195]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_cart;
CREATE PROCEDURE insert_values_cart(
    IN pid INT,
    IN cid INT,
    IN sid INT,
    IN qty INT,
    IN done INT)
BEGIN
    DECLARE price_value INT;
    DECLARE oid INT;
    DECLARE tqty INT;
    DECLARE tamt INT;
    DECLARE piqty INT;
    DECLARE pcqty INT DEFAULT 0;

    DECLARE c_pid INT;
    DECLARE c_qty INT;
    DECLARE c_done BOOLEAN DEFAULT 0;
    DECLARE done_flag INT DEFAULT 0; -- A flag to signal when to exit the loop
    DECLARE inventory_cursor CURSOR FOR 
                                    SELECT product_id, SUM(quantity) 
                                    FROM cart 
                                    WHERE customer_id = cid
                                    GROUP BY product_id 
                                    ORDER BY done ASC;
    
    DECLARE CONTINUE HANDLER FOR NOT FOUND SET done_flag = 1;

    -- Start the transaction
    START TRANSACTION;

    -- Fetch the price of the product
    SELECT COALESCE(MAX(price), 0) INTO price_value 
    FROM price_history
    WHERE product_id = pid 
    AND effective_date <= CURDATE()
    ORDER BY effective_date DESC 
    LIMIT 1;

    -- Fetch the available quantity in inventory
    SELECT COALESCE(SUM(quantity), 0) INTO piqty 
    FROM inventory 
    WHERE product_id = pid;

    -- Check for existing cart entry and adjust the quantity if needed
    IF EXISTS (SELECT 1 FROM cart WHERE product_id = pid AND customer_id = cid AND seller_id = sid) THEN
        SELECT quantity INTO pcqty FROM cart WHERE product_id = pid AND customer_id = cid AND seller_id = sid;
    END IF;

    SET qty = qty + pcqty;

    -- Check if there is enough inventory and price is valid
    IF piqty >= qty AND price_value > 0 AND piqty > 0 THEN
        IF pcqty > 0 THEN
            UPDATE cart 
            SET quantity = qty 
            WHERE product_id = pid 
            AND customer_id = cid 
            AND seller_id = sid;
        ELSE        
            INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
            VALUES (pid, cid, sid, qty, qty * price_value, done);
        END IF;
    ELSE 
        ROLLBACK;
        SIGNAL SQLSTATE '45000' 
        SET MESSAGE_TEXT = 'Quantity cannot be less than inventory value';
    END IF;

    -- Proceed with creating orders if the cart is done
    IF EXISTS (SELECT 1 FROM cart WHERE customer_id = cid AND done = 1) THEN
        OPEN inventory_cursor;

        -- REPEAT UNTIL loop to process each row fetched by the cursor
        REPEAT
            FETCH inventory_cursor INTO c_pid, c_qty;
            IF NOT done_flag THEN
                -- Update inventory based on the quantity fetched from the cart
                UPDATE inventory 
                SET quantity = (quantity - c_qty) 
                WHERE product_id = c_pid;
            END IF;
        UNTIL done_flag END REPEAT;

        CLOSE inventory_cursor;

        -- Insert the order record
        INSERT INTO orders(customer_id, total_quantity, total_amount)
        SELECT customer_id, SUM(quantity), SUM(total_amount) 
        FROM cart 
        WHERE customer_id = cid 
        GROUP BY customer_id;

        -- Fetch the most recent order ID
        SELECT order_id INTO oid 
        FROM orders 
        WHERE customer_id = cid 
        ORDER BY order_date DESC 
        LIMIT 1;

        -- Insert the order items
        INSERT INTO orderitems(order_id, product_id, customer_id, seller_id, quantity, total_amount)
        SELECT oid, product_id, customer_id, seller_id, quantity, total_amount 
        FROM cart 
        WHERE customer_id = cid;

        -- Clear the cart after order is created
        DELETE FROM cart WHERE customer_id = cid;

    END IF;

    -- Commit the transaction
    COMMIT;
END;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [216]:
%%sql
DROP PROCEDURE IF EXISTS insert_values_employees;
CREATE PROCEDURE insert_values_employees(
    IN fname VARCHAR(50),
    IN lname VARCHAR(50),
    IN age INT,
    IN ph VARCHAR(16),
    IN email VARCHAR(50),
    IN role VARCHAR(20)
)
BEGIN
    INSERT INTO employees(first_name, last_name, age, phone_number, email, role)
    VALUES (fname,lname,age,ph,email,role);

    INSERT INTO audit(action, changed_by, on_table, on_column, old_value, new_value)
    VALUES ('insert', USER(), 'products', 'all', NULL, CONCAT('Name: ', fname,' ',lname,' Age:',age,' Phone:',ph,
            ' Email:',email,' Role:',role));

END

 * mysql+pymysql://root:***@localhost:3306/
(pymysql.err.OperationalError) (1046, 'No database selected')
[SQL: DROP PROCEDURE IF EXISTS insert_values_employees;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [227]:
%%sql
DROP PROCEDURE IF EXISTS copy_shipping_address;
CREATE PROCEDURE copy_shipping_address(
    IN cid INT,
    IN oid INT
)

BEGIN
    INSERT INTO shipping(order_id, shipping_addresss, city, state, postalcode, country) (SELECT oid,address,city,state,postal_code,country 
                          FROM customers WHERE customer_id = cid);
END

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.
0 rows affected.

[]

In [228]:
%%sql
call copy_shipping_address(1,1);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

In [231]:
%%sql
select * from shipping;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(1, 1, None, 'pending', None, '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India')]

In [ ]:
%sql

In [ ]:
%sql

In [ ]:
%sql

In [ ]:
%%sql
# truncate customers;

In [ ]:
%%sql
use customersdb;
INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Riya', 'Chatterjee', 'female', 29, 'riya.chat29@example.com', '9812345001', '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Sahil', 'Malhotra', 'male', 35, 'sahil.malhotra35@example.com', '9911122233', '7 Block D, Punjabi Bagh', 'Delhi', 'Delhi', '110026', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Kavya', 'Reddy', 'female', 31, 'kavya.reddy31@example.com', '9845123401', '98 Road No. 10', 'Hyderabad', 'Telangana', '500034', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Aditya', 'Verma', 'male', 27, 'aditya.verma27@example.com', '9898989898', '221 Rajiv Nagar', 'Patna', 'Bihar', '800001', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Neha', 'Desai', 'female', 40, 'neha.desai40@example.com', '9822054321', '66 Shivaji Park', 'Mumbai', 'Maharashtra', '400028', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Manoj', 'Kumar', 'male', 33, 'manoj.kumar33@example.com', '9830012345', '45 Vivekananda Street', 'Kolkata', 'West Bengal', '700019', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Tanvi', 'Nair', 'female', 26, 'tanvi.nair26@example.com', '9998800001', '12 MG Layout', 'Chennai', 'Tamil Nadu', '600028', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Arvind', 'Gupta', 'male', 38, 'arvind.gupta38@example.com', '9810001234', '9 City Centre', 'Ahmedabad', 'Gujarat', '380015', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Nikita', 'Sharma', 'female', 30, 'nikita.sharma30@example.com', '9876543210', '78 Model Town', 'Jalandhar', 'Punjab', '144003', 'India', NOW(4));

INSERT INTO customers (first_name, last_name, gender, age, email, ph_num, address, city, state, postal_code, country, registration_date)
VALUES ('Vikram', 'Singh', 'male', 45, 'vikram.singh45@example.com', '9988776655', '50 MI Road', 'Jaipur', 'Rajasthan', '302001', 'India', NOW(4));

In [ ]:
%%sql
CALL insert_date_in_customers(
    'Neha', 'Saxena', 'female', 28, 'neha.saxena10@example.com', '9991000010',
    '2 Boring Road', 'Patna', 'Bihar', '800001', 'India');

In [ ]:
%%sql
CALL insert_date_in_customers(
    'Varun', 'Malik', 'male', 36, 'varun.malik0009@example.com', '9993008229',
    '10 Sector 12', 'Gurgaon', 'Haryana', '122001', 'India');

In [ ]:
%%sql
SELECT * FROM CUSTOMERS;

In [ ]:
%%sql
-- Normal Insert: Insert a category directly
INSERT INTO category(category_name, description)
VALUES ('Electronics', 'Devices and gadgets like phones, laptops, etc.');

INSERT INTO category(category_name, description)
VALUES ('Clothing', 'Apparel and fashion items such as shirts, pants, etc.');

INSERT INTO category(category_name, description)
VALUES ('Groceries', 'Food items, vegetables, fruits, etc.');

In [ ]:
%%sql
-- Insert categories using the stored procedure
CALL insert_values_category('Toys', 'Playthings for children, games, and puzzles.');
CALL insert_values_category('Furniture', 'Chairs, tables, beds, and other furniture items.');

In [ ]:
%%sql
SELECT * FROM CATEGORY;

In [ ]:
%%sql
-- Insert products directly into the products table

-- Product: Smartphone in Electronics category (category_id = 1)
INSERT INTO products(product_name, description, category_id)
VALUES ('Smartphone', 'Latest model smartphone with advanced features', 1);

-- Product: T-shirt in Clothing category (category_id = 2)
INSERT INTO products(product_name, description, category_id)
VALUES ('T-shirt', 'Cotton t-shirt with modern design', 2);

-- Product: Apple in Groceries category (category_id = 3)
INSERT INTO products(product_name, description, category_id)
VALUES ('Apple', 'Fresh red apples, locally grown', 3);

-- Product: Laptop in Electronics category (category_id = 1)
INSERT INTO products(product_name, description, category_id)
VALUES ('Laptop', 'High-performance laptop for gaming and work', 1);

In [178]:
%%sql

-- Product: Jeans in Clothing category (category_id = 2)
INSERT INTO products(product_name, description, category_id)
VALUES ('Jeans', 'Blue denim jeans, slim fit', 2);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[]

In [179]:
%%sql
select * from products;

 * mysql+pymysql://root:***@localhost:3306/
6 rows affected.

[(1, 'Smartphone', 'Latest model smartphone with advanced features', 1),
 (2, 'T-shirt', 'Cotton t-shirt with modern design', 2),
 (3, 'Apple', 'Fresh red apples, locally grown', 3),
 (4, 'Laptop', 'High-performance laptop for gaming and work', 1),
 (5, 'Jeans', 'Blue denim jeans, slim fit', 2),
 (13, 'Jesans', 'Blue desnim jeans, slim fit', 2)]

In [180]:
%%sql
-- Insert inventory data directly into the inventory table

-- Inventory for Smartphone (product_id = 1)
INSERT INTO inventory(product_id, quantity)
VALUES (1, 100);

-- Inventory for T-shirt (product_id = 2)
INSERT INTO inventory(product_id, quantity)
VALUES (2, 200);

-- Inventory for Apple (product_id = 3)
INSERT INTO inventory(product_id, quantity)
VALUES (3, 500);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [181]:
%%sql
-- Call the procedure to insert inventory data


-- Insert inventory for Laptop (product_id = 4, quantity = 50)
CALL insert_values_inventory(4, 50);

-- Insert inventory for Jeans (product_id = 5, quantity = 150)
CALL insert_values_inventory(5, 150);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [184]:
%%sql
-- Insert price history data directly into the price_history table

-- Price for Smartphone (product_id = 1)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (1, 599.99, YEAR(CURDATE()), '2025-01-01');

-- Price for T-shirt (product_id = 2)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (2, 19.99, YEAR(CURDATE()), '2025-02-01');

-- Price for Apple (product_id = 3)
INSERT INTO price_history(product_id, price, fiscal_year, effective_date)
VALUES (3, 1.99, YEAR(CURDATE()), '2025-03-01');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [183]:
%%sql
-- Call the procedure to insert price history data

# -- Insert price for Smartphone (product_id = 1, price = 599.99, effective_date = '2025-01-01')
# CALL insert_values_price(1, 599.99, '2025-01-01');

# -- Insert price for T-shirt (product_id = 2, price = 19.99, effective_date = '2025-02-01')
# CALL insert_values_price(2, 19.99, '2025-02-01');

# -- Insert price for Apple (product_id = 3, price = 1.99, effective_date = '2025-03-01')
# CALL insert_values_price(3, 1.99, '2025-03-01');

-- Insert price for Laptop (product_id = 4, price = 1299.99, effective_date = '2025-01-15')
CALL insert_values_price(4, 1299.99, '2025-01-15');

-- Insert price for Jeans (product_id = 5, price = 39.99, effective_date = '2025-02-15')
CALL insert_values_price(5, 39.99, '2025-02-15');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [185]:
%%sql
-- Insert employees directly into the employees table

-- Employee 1: John Doe (Manager)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role)
VALUES ('John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', 'Manager');

-- Employee 2: Alice Smith (Team Member under John)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
VALUES ('Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', 'Team Member', 1);

-- Employee 3: Bob Johnson (Team Member under John)
INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
VALUES ('Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', 'Team Member', 1);

# -- Employee 4: Sarah White (Team Member under Alice)
# INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
# VALUES ('Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', 'Team Member', 2);

# -- Employee 5: Tom Brown (Team Member under Bob)
# INSERT INTO employees(first_name, last_name, age, phone_number, email, role, manager_id)
# VALUES ('Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', 'Team Member', 3);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [186]:
%%sql
-- Call the procedure to insert employees

# -- Insert Employee 1: John Doe (Manager)
# CALL insert_values_employees('John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', 'Manager');

# -- Insert Employee 2: Alice Smith (Team Member under John)
# CALL insert_values_employees('Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', 'Team Member');

# -- Insert Employee 3: Bob Johnson (Team Member under John)
# CALL insert_values_employees('Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', 'Team Member');

-- Insert Employee 4: Sarah White (Team Member under Alice)
CALL insert_values_employees('Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', 'Team Member');

-- Insert Employee 5: Tom Brown (Team Member under Bob)
CALL insert_values_employees('Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', 'Team Member');

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.

[]

In [187]:
%%sql
select * from employees;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 'John', 'Doe', 45, '123-456-7890', 'john.doe@example.com', datetime.date(2025, 8, 5), 'Manager', None, None, 1),
 (2, 'Alice', 'Smith', 30, '987-654-3210', 'alice.smith@example.com', datetime.date(2025, 8, 5), 'Team Member', None, 1, 1),
 (3, 'Bob', 'Johnson', 35, '555-123-4567', 'bob.johnson@example.com', datetime.date(2025, 8, 5), 'Team Member', None, 1, 1),
 (4, 'Sarah', 'White', 28, '444-987-6543', 'sarah.white@example.com', datetime.date(2025, 8, 5), 'Team Member', None, None, 1),
 (5, 'Tom', 'Brown', 32, '333-555-7777', 'tom.brown@example.com', datetime.date(2025, 8, 5), 'Team Member', None, None, 1)]

In [188]:
%%sql
select * from audit;

 * mysql+pymysql://root:***@localhost:3306/
10 rows affected.

[(1, 'insert', 'root@localhost', 'customers', 'all', None, 'Inserted:Neha Saxena, Email:neha.saxena10@example.com,Phone:0', datetime.datetime(2025, 8, 5, 18, 8, 23)),
 (2, 'insert', 'root@localhost', 'customers', 'all', None, 'Inserted:Varun Malik, Email:varun.malik0009@example.com,Phone:9993008229', datetime.datetime(2025, 8, 5, 18, 16, 14)),
 (3, 'insert', 'root@localhost', 'customers', 'all', None, 'Inserted:Neha Saxena, Email:neha.saxena10@example.com,Phone:9991000010', datetime.datetime(2025, 8, 5, 18, 17, 35)),
 (4, 'insert', 'root@localhost', 'customers', 'all', None, 'Inserted:Varun Malik, Email:varun.malik0009@example.com,Phone:9993008229', datetime.datetime(2025, 8, 5, 18, 17, 45)),
 (5, 'insert', 'root@localhost', 'products', 'all', None, 'Product: 4Quantity: 50', datetime.datetime(2025, 8, 5, 18, 30, 51)),
 (6, 'insert', 'root@localhost', 'products', 'all', None, 'Product: 5Quantity: 150', datetime.datetime(2025, 8, 5, 18, 30, 51)),
 (7, 'insert', 'root@localhost', 'price', 'price', None, '1300', datetime.datetime(2025, 8, 5, 18, 32, 22)),
 (8, 'insert', 'root@localhost', 'price', 'price', None, '40', datetime.datetime(2025, 8, 5, 18, 32, 22)),
 (9, 'insert', 'root@localhost', 'products', 'all', None, 'Name: Sarah White Age:28 Phone:444-987-6543 Email:sarah.white@example.com Role:Team Member', datetime.datetime(2025, 8, 5, 18, 33, 42)),
 (10, 'insert', 'root@localhost', 'products', 'all', None, 'Name: Tom Brown Age:32 Phone:333-555-7777 Email:tom.brown@example.com Role:Team Member', datetime.datetime(2025, 8, 5, 18, 33, 42))]

In [189]:
%%sql
-- Insert data directly into the cart table

-- Customer 1 adds 2 Smartphones (product_id = 1, seller_id = 1)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (1, 1, 1, 2, 2 * 599.99, 0);

-- Customer 2 adds 1 T-shirt (product_id = 2, seller_id = 2)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (2, 2, 2, 1, 1 * 19.99, 0);

-- Customer 1 adds 3 Apples (product_id = 3, seller_id = 1)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (3, 1, 1, 3, 3 * 1.99, 0);

-- Customer 3 adds 1 Laptop (product_id = 4, seller_id = 3)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (4, 3, 3, 1, 1 * 1299.99, 0);

-- Customer 2 adds 2 Jeans (product_id = 5, seller_id = 2)
INSERT INTO cart(product_id, customer_id, seller_id, quantity, total_amount, done)
VALUES (5, 2, 2, 2, 2 * 39.99, 0);

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [197]:
%%sql
select * from cart;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, 1, 2, 1200, 0),
 (2, 2, 2, 1, 20, 0),
 (3, 1, 1, 3, 6, 0),
 (4, 3, 3, 1, 1300, 0),
 (5, 2, 2, 2, 80, 0)]

In [198]:
%%sql
select * from orderitems;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [199]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [208]:
%%sql
CALL insert_values_cart(1, 1, 1, 2, 1);

 * mysql+pymysql://root:***@localhost:3306/
(pymysql.err.OperationalError) (1442, "Can't update table 'inventory' in stored function/trigger because it is already used by statement which invoked this stored function/trigger.")
[SQL: CALL insert_values_cart(1, 1, 1, 2, 1);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [236]:
%%sql
select * from cart;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(4, 3, 3, 1, 1300, 0)]

In [235]:
%%sql
CALL insert_values_cart(1, 2, 1, 2, 1);

 * mysql+pymysql://root:***@localhost:3306/
0 rows affected.

[]

In [237]:
%%sql
select * from orderitems;

 * mysql+pymysql://root:***@localhost:3306/
5 rows affected.

[(1, 1, 1, 1, 1, 4, 1200),
 (2, 1, 3, 1, 1, 3, 6),
 (4, 2, 2, 2, 2, 1, 20),
 (5, 2, 5, 2, 2, 2, 80),
 (6, 2, 1, 2, 1, 2, 1200)]

In [238]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost:3306/
2 rows affected.

[(1, 1, 7, 1206, datetime.datetime(2025, 8, 5, 18, 40, 43)),
 (2, 2, 5, 1300, datetime.datetime(2025, 8, 5, 19, 7, 13))]

In [239]:
%%sql
select * from shipping;

 * mysql+pymysql://root:***@localhost:3306/
1 rows affected.

[(1, 1, None, 'pending', None, '32 Lake Road', 'Kolkata', 'West Bengal', '700029', 'India')]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql